[
  {
    "name": "Innovation Lab of a Fortune 500 office supply chain store (Details under NDA)",
    "keywords": ["clojure", "hadoop", "amazon redshift"],
    "locations": ["san francisco", "bangalore"],
    "description":
    [
      "The client is a major player in office supplies worldwide. Their Innovation Lab is an internal department which focuses on increasing conversions across their online and offline properties through personalized offers to the buyer. By tracking the customer clickstream and comparing it with the standard buying patterns, the statistical modeling predicts the buying choices of the customer in real time. This data is then used to generate offers specific to the customer in a request response cycle (10ms SLA).",
      "C42 Engineering worked with the client team to add features and enhance the platform. C42 was also involved in implementing an Extract-Transform-Load process to load the clickstream data from Hadoop (used for statistical modeling) into Amazon's Redshift. This was used to improve the quality of realtime reports on the performance of various experimental models run by the team."
    ]
  },
  {
    "name": "Top multinational management consulting firm (Details under NDA)",
    "keywords": ["coaching","software craftsmanship","bootcamp","bangalore"],
    "locations": ["bangalore"],
    "description":
    [
      "C42 Engineering was hired to design and deliver the first two iterations of a 6 week customized software craftsmanship bootcamp. The programme introduces participants to the Software Engineering practices necessary to enable continuous delivery with a high degree of consistency and a low defect rate.",
      "The topics covered include Object Oriented Design, TDD, Design Patterns, Javascript, Ruby and Ruby on Rails. The client will run this programme to induct every batch of  Computer Science graduates they hire moving forward. Our involvement with this programme continues as we transition the running of the programme to client staff."
    ]
  },
  {
    "name": "Next generation digital media platform (Details under NDA)",
    "keywords": ["clojure","react.js","microservices","chef","continuous delivery","san francisco/bangalore/delhi"],
    "locations": ["san francisco","bangalore","delhi"],
    "description":
    [
      "Founded by a team of Indian media industry veterans and serial entrepreneurs with a track record of substantial exits, the client is a startup focused on disrupting digital media publishing.",
      "Digital publishing is still in the dark ages, with the most commonly used platforms today being Wordpress and its cousins. The available solutions are over 10 years old, and are essentially a patchwork of blogging tools and plugins. The client is building the next generation of digital publishing platforms, one that addresses the needs of modern digital publishers and gives today's connected Internet users the means to consume and engage with content the way they want, where they want.",
      "C42 was engaged by the client at the earliest stages of product inception and saw it through to launch. We have contributed to the architecture, development and deployment of the entire solution stack."
    ]
  },
  {
    "name": "Fastest growing e-commerce business in the $14B wedding fashion industry (Details under NDA)",
    "keywords": ["rails","mySQL","solr","e-commerce","san francisco/pune"],
    "locations": ["san francisco","pune"],
    "description":
    [
      "The client had recently proved product market fit and raised a round of financing. Their existing e-commerce system was an off-the-shelf CMS. It was simply not flexible enough to support the experimentation necessary to stay on a hockey-stick growth curve. Onboarding product types and running complex A/B tests to streamline funnels took far too much time and effort.",
      "C42 Engineering first worked with the client to transition their engineering team from PHP to Rails, then helped architect and build the application that is currently handling millions of visits every month. We've worked with them through 100x growth and continue to work with them to help achieve the next 100x."
    ]
  },
  {
    "name": "Flipkart.com: India's top E-commerce company",
    "keywords": ["rails","padrino","extreme programming","jruby","REST"],
    "locations": ["bangalore"],
    "description":
    [
      "Flipkart, India's top online retailer, hired us to help support their teams and build their Ruby/Rails capabilities as well as for our expertise in DevOps and Agile practices."
    ],
    "image": "flipkart.png",
    "company": "Flipkart.com",
    "company_url": "http://flipkart.com/",
    "quote": {
      "small": "",
      "large": "C42 has been working with our Ruby & Rails teams for the past few months. They've shown a high level of ownership and have been driving improvements in agile practices and Ruby usage in our teams. They've also been contributing to DevOps and infrastructure pieces where needed. We're very happy with their contributions and look forward to continuing our relationship with them.",
      "author": "Yogi Kulkarni",
      "title": "Technical Architect"
    }
  },
  {
    "name": "A Y-combinator funded startup for business budgeting and cash flow planning.",
    "keywords": ["rails","CI","TDD"],
    "locations": ["san francisco","bangalore"],
    "description":
    [
      "We were brought in to help the team develop certain best practices like TDD and Continuous Integration, while also delivering core business functionality."
    ],
    "image": "indinero-thumb.png",
    "company": "InDinero",
    "company_url": "http://indinero.com",
    "quote": {
      "small": "The coders at C42 are absolutely awesome - they’re prolific about writing high quality code, and they’ve even taught us how to improve our engineering practices.",
      "medium": "The coders at C42 are absolutely awesome - they’re prolific about writing high quality code, and they’ve even taught us how to improve our engineering practices.  They know how to make offshore development work well, and their communication skills are top-notch.  After interviewing almost a dozen other firms, we ultimately decided to work with C42.",
      "large": "The coders at C42 are absolutely awesome - they’re prolific about writing high quality code, and they’ve even taught us how to improve our engineering practices.  They know how to make offshore development work well, and their communication skills are top-notch.  By the end of the first week, they were working at full-speed, building new features and executing on our infinitely long product roadmap.  It was easier to onboard C42 than it was to onboard any other developer we’ve worked with. After interviewing almost a dozen other firms, we ultimately decided to work with C42.",
      "author": "Jessica Mah",
      "title": "CEO"
    }
  },
  {
    "name": "Auto dialer for political and commercial campaigns.",
    "keywords": ["rails","cloud","ec2","twilio","san francisco/bangalore"],
    "locations": ["san francisco","bangalore"],
    "description":
    [
      "We are the primary development team behind Impact Dialing. We are in charge of ongoing feature development, testing, and deployment, of all components of the application. We work closely with the people at Impact Dialing to improve the quality of their codebase and the processes they use to develop their product."
    ],
    "image": "impact-thumb.png",
    "company": "Impact Dialing",
    "company_url": "http://www.impactdialing.com/",
    "quote": {
      "small": "",
      "medium": "",
      "large": "Working with C42 is a dream. A lot of people gave me offshoring horror stories, but C42 defied all of the warnings and has exceeded my expectations. They're expert Ruby developers, they work hard, and they communicate well. When I need to grow my team, I plan to hire another pair from C42.",
      "author": "Michael Kaiser-Nyman",
      "title": "CEO & Founder"
    }
  },
  {
    "name": "A video discovery tool with extensive social media integration",
    "keywords": ["rails","REST","jruby","couchdb","twitter","facebook","cloud","ec2"],
    "locations": ["bangalore"],
    "description":
    [
      "We are working with Althea Systems to help build key components of shufflr.tv, a web version of their social video browser, Shufflr. The work involves working with a variety of technologies including Rails 3, JRuby, the Facebook Graph API, the Twitter API and CouchDB with the objective of helping users discover, watch and share videos on the web."
    ],
    "image": "shufflr-thumb.jpg",
    "company": "Althea Systems",
    "company_url": "http://altheasystems.com/",
    "quote": {
      "small": "",
      "medium": "",
      "large": "C42 is just the kind of highly competent and agile Rails house we were looking for, to work with us in building a new web product on the lines of Shufflr desktop. Having explored various outsourcing options within and outside Bangalore, I can say that such talent & workmanship is extremely hard to find in Indian tech consulting companies. Good luck to the C42 folks, ahead.",
      "author": "Vijaya Sagar",
      "title": "Founder & VP Engineering"
    }
  },
  {
    "name": "Travel Planning and Booking application MVP",
    "keywords": ["rails","travel","facebook apis","MVP"],
    "locations": ["san francisco","bangalore"],
    "description":
    [
      "It is currently complicated and cumbersome to plan amazing international vacations. CleverBootz is going to change that. Their goal is to make the planning every bit as fun as the actual trip by re-thinking the process of international vacation planning as a fun, social experience.",
      "CleverBootz approached us with 4 wireframes, a 2 page requirements document, a solid business plan and an amazing business team. It has been a roller coaster journey since then: while the overall goal was to deliver a prototype, things weren't that straightforward. The requirements changed a lot as we learned more about our users and the travel ecosystem on multiple continents. Using Rails and XP practices we were able to provide an environment where these changes could be accommodated really easily resulting in a prototype that was well received by customers on a tight schedule. We are continuing to work with CleverBootz as they build out their product."
    ],
    "image": "cleverbootz-thumb.jpg",
    "company": "CleverBootz, Inc.",
    "company_url": "http://www.cleverbootz.com/",
    "quote": {
      "small": "I love working with C42! They demonstrate a strong sense of ownership and are really thoughtful in their approach to solving client needs. Their execution and communication are also stellar. I trust them completely with my product.",
      "medium": "",
      "large": "C42 has been amazing to work with. I've worked primarily with Aakash for the last 3 months, and have been really impressed. He is a rockstar engineer, maintains open channels of communication at all times and demonstrates a strong sense of ownership. Not only does he ensure that the implementation closely matches the business needs, but he also thinks through the user flow and makes great recommendations to improve the overall experience. I've also interacted to a limited extent with the rest of the team, and their values strongly mirror what I’ve seen with Aakash. I trust C42 completely with my product.",
      "author": "Minal Mehta",
      "title": "Co-Founder & CEO"
    }
  }
]
